/*1.5. Логические операторы.
В первой задаче мы пишем условие if, что переменная age в диапазоне от 14 до 90*/

'use strict';

let age = prompt('Скильки вам годив?','');
if (age >= 14 && age <= 90) {
    alert('Добре!');
}
else {
    alert('Пишив нах');
}

//пишем тоже самое, но наборот, число вне диапазона

if (age >= 14 || age <= 90) {
    alert('Пишив нах');
}
else {
    alert('Добре!');
}

//и второй вариант с использованием оператора "!"

if (!(age >= 14 && age <= 90)) { //честно скажу, до этого не сам додумался
    alert('Пишив нах');
}
else {
    alert('Добре!');
}

//пишем скрипт для логов, использую вложенные блоки if

let login = prompt('Привет, кто там?', 'Дейв Поц' );
let password = prompt('Пароль?','Screach123');
if (login === null) {
    alert('Пока...');
}
else if (login === 'Дейв Поц') {
    if (password === null) {
        alert('Пока...')
    }
    else if (password === 'Screach123') {
        alert('Здравствуйте!')
    }
else {
    alert('ВЫ КТО ТАКИЕ? Я ВАС НЕ ЗВАЛ!!!');
    }

}

//вообще эта задача предполагала использование логических операторов, но я чет забыл(((((((((((((((((